2022-12-09-kindle-scribe.html
<!DOCTYPE html>
<html lang="ja"><head><meta charset="utf-8"/><meta name="viewport" content="width=device-width, initial-scale=1"/><title>Kindle Scribe の購入を正当化する - toybeam</title><meta name="description" content="devlog of toyboot4e"/><link rel="stylesheet" href="style/simple.min.css"/><link rel="stylesheet" href="style/style.css"/><link rel="stylesheet" href="style/prism.css"/><!-- MathJax --></head><body><header role="banner"><h1>Kindle Scribe の購入を正当化する</h1><p>Dec  9, 2022</p><nav role="navigation"><a href="/">Home</a><a href="https://github.com/toyboot4e">GitHub</a></nav></header><main role="main">
<div id="outline-container-org53cd66e" class="outline-2">
<h2 id="org53cd66e"><a href="#org53cd66e">背景</a></h2>
<div class="outline-text-2" id="text-org53cd66e">
<p>
<a href="https://www.amazon.co.jp/dp/B09BSMBWXD/ref=dp_iou_view_product?ie=UTF8&amp;psc=1">Kindle Scribe</a> を購入しました。 E-ink ディスプレイ 10.2 インチ、これは <b>オライリー本のサイズ</b> に匹敵します。とうとう紙が要らない時代にやって来ました！<br>
</p>

<p>
iPad (動画) や Shokz (音声) と異なって、 Kindle Scribe (本) は既製の Kindle や紙と競合します。本当に買う価値があったのか？　自身の行動を振り返ってみます。<br>
</p>
</div>
</div>

<div id="outline-container-org74c3c18" class="outline-2">
<h2 id="org74c3c18"><a href="#org74c3c18">Kindle Scribe でやったこと</a></h2>
<div class="outline-text-2" id="text-org74c3c18">
<p>
画面が大きいと、気軽に PDF を読むことができます。 PDF が読めるとなると……<br>
</p>
</div>

<div id="outline-container-org10a2adf" class="outline-3">
<h3 id="org10a2adf"><a href="#org10a2adf">簡単な論文を読んだ</a></h3>
<div class="outline-text-3" id="text-org10a2adf">
<p>
……論文が読めます。 Haskell を使ったゲーム開発は論文になるのですね。<br>
</p>

<p>
<a href="https://github.com/jonascarpay/apecs/blob/master/apecs/prepub.pdf">Apecs: A Type-Driven Entity-Component-System Framework</a> を読みました。正式な論文なのかは分かりませんが (論文を書いたことが無い) 、高品質なブログ記事という趣です。<br>
</p>

<p>
<a href="https://hackage.haskell.org/package/apecs">Apecs</a> は <a href="https://github.com/amethyst/specs">SPECS</a> に影響を与えたという風に書いてあります。そうだったのか……？　あまり具体的なコードを読まずに全体の流れを知ることができますから、エアプに適しています。 <a href="https://hackage.haskell.org/package/apecs">Apecs</a> のチュートリアルを読むよりも、この論文 (?) を読む方が負荷が軽いのです。どちらかと言えば、 Apecs は最小構成の ECS 実装であることが分かりました。<br>
</p>

<p>
読後は <a href="https://is.muni.cz/th/zedur/Game_development_in_Haskell_Archive.pdf">Game Development in Haskell</a> を読んでいます。 <a href="https://hackage.haskell.org/package/apecs">Apecs</a> を使ったり、独自ライブラリでゲームを作る内容ですから、ぜひとも読みたいコンテンツでしたが、実際は 1 ページも読んでいませんでした。 Kindle Scribe があればページが進みます。<br>
</p>
</div>
</div>

<div id="outline-container-orge4b3111" class="outline-3">
<h3 id="orge4b3111"><a href="#orge4b3111">積み本崩しが進む……かも</a></h3>
<div class="outline-text-3" id="text-orge4b3111">
<p>
読みかけの PDF がありますが、なんとなく読む気がしない。 Kindle Scribe によってその状況が打破でき……そうです。 3 年後には！<br>
</p>

<ul class="org-ul">
<li><a href="https://www.lua.org/doc/jucs05.pdf">The implementation of Lua 5</a><br>
言語実装のお供に！<br></li>
<li><a href="https://www.manning.com/books/type-driven-development-with-idris">Type-Driven Development with Idris</a><br>
関数型言語の本が尽きたら！<br></li>
<li><a href="https://nostarch.com/rust-rustaceans">Rust for Rustacians</a><br>
その次に！<br></li>
</ul>
</div>
</div>

<div id="outline-container-org4aa9028" class="outline-3">
<h3 id="org4aa9028"><a href="#org4aa9028">ebook を探すようになった</a></h3>
<div class="outline-text-3" id="text-org4aa9028">
<p>
新しいコンテンツは電子書籍で探します。技術書は特に出版社から直接購入できる場合が多いです。<br>
</p>
</div>

<div id="outline-container-org6be959a" class="outline-4">
<h4 id="org6be959a"><a href="#org6be959a">ラムダノート</a></h4>
<div class="outline-text-4" id="text-org6be959a">
<p>
<a href="https://www.lambdanote.com/collections/frontpage">ラムダノート</a> の <a href="https://www.lambdanote.com/products/peering">ピアリング戦記</a> を読んでいます。まず internetworking という言葉を知らなかった時点で面白い。時雨堂のセールに感謝です。<br>
</p>
</div>
</div>

<div id="outline-container-org99327f5" class="outline-4">
<h4 id="org99327f5"><a href="#org99327f5">O'Reilly Japan</a></h4>
<div class="outline-text-4" id="text-org99327f5">
<p>
<a href="https://www.oreilly.co.jp/books/9784873118789/">Real World HTTP ミニ版</a> を読んでいます。なんと無料！　前書きが全文暗記したいほど面白いので『間違いない』と思います。これも Kindle Scra (略)<br>
</p>

<p>
<a href="https://www.oreilly.co.jp/ebook/#all_titles">O'Reilly Japan の ebook</a> を見てニヤニヤする時間を得ました。表紙一覧が見えないことに苦しみを覚えますが、 <a href="https://github.com/ericchiang/pup">pup</a> がなんとかしてくれました。<br>
</p>

<ul class="org-ul">
<li><a href="https://www.oreilly.co.jp/books/9784873119977/">Go 言語による分散サービス</a> の表紙が面白い<br></li>
</ul>

<ul class="org-ul">
<li><a href="https://www.oreilly.co.jp/books/9784873119595/">並行プログラミング入門</a> の表紙は <a href="//www.oreilly.co.jp/books/9784873116891/">Haskellによる並列・並行プログラミング</a> の流れを継いでいた<br></li>
<li><a href="https://www.oreilly.co.jp/books/9784873116020/">例題で学ぶ微分方程式</a> など <a href="https://www.oreilly.co.jp/books/math/">数学の本</a> がある<br></li>
</ul>
</div>
</div>

<div id="outline-container-org5bbdf4b" class="outline-4">
<h4 id="org5bbdf4b"><a href="#org5bbdf4b">BOOTH</a></h4>
<div class="outline-text-4" id="text-org5bbdf4b">
<p>
<a href="https://booth.pm/ja/search/haskell">BOOTH で『Haskell』と検索</a> すると、我らが『Haskell で戦う競技プログラミング入門』はもちろん、λ計算や圏論への道も開かれていることが分かります。<br>
</p>

<p>
技術同人誌の売り場は BOOTH から Zenn に移行しています。 Zenn のコンテンツは基本ダウンロードできませんから、少し考える必要があります。<br>
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbe1f315" class="outline-2">
<h2 id="orgbe1f315"><a href="#orgbe1f315">まとめ</a></h2>
<div class="outline-text-2" id="text-orgbe1f315">
<p>
Kindle Scribe では他の本に移動するのが面倒なので、まず 1 ページを読んでしまいます。 1 ページ読めばこちらのものです。<br>
</p>

<p>
論文を読み始めたのは意外な収穫でした。フォーマット変換が不要な分だけ、ブログ記事よりもお手軽なのです。新鮮なコンテンツを味わっていきたいと思います。<br>
</p>
</div>
</div>
</main><footer role="contentinfo"><p>Styled with <a href="https://simplecss.org/">Simple.css</a></p><div><a href="/">Home</a><a href="https://github.com/toyboot4e">GitHub</a></div></footer></body></html>
